Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: don't leave the writing to the end because they find it boring at that stage .
af: soos wat hulle nuwe idees kry geniet hulle dit gewoonlik meer om dit neer te skryf omdat dit dan oor hul eie idees gaan dit is een van die groot pluspunte van tegnologie op skool .

source: when they are getting new ideas they often enjoy writing because they are writing about their own ideas; this is a great strength of technology in school .
af: op hierdie manier word die geletterdheidsuitdaging deur middel van die vak wetenskap en tegnologie aangespreek .

source: the local museum has asked your school if they have any models of vertebrate skeletons for a display .
af: die plaaslike museum het die skool gevra of hulle enige modelle van werweldierskelette het om uit te stal .

source: your teacher has suggested making your own animal skeleton models .
af: jou onderwyser stel voor dat ons ons eie modelle van diereskelette maak .

source: we can then better understand the idea of skeletons as structures and use these models to put on display .
af: ons kan dan die konsep van skelette as strukture beter verstaan en die modelle sommer ook uitstal .

source: as a project you need to design and make a skeleton for a vertebrate .
af: 'n skelet van 'n werweldier moet as 'n projek ontwerp word .

source: this will be a frame structure .
af: dit sal 'n raamstruktuur wees .

source: you may use the following materials
af: jy mag die volgende materiale gebruik

source: let's investigate and do some research around how to build a shell or frame structure .
af: kom ons ondersoek en doen navorsing om uit te vind hoe om 'n dop of raamstruktuur te bou .

source: we looked at different ways to strengthen structures using special shapes and struts .
af: ons het na verskillende maniere gekyk hoe om strukture met behulp van spesiale vorms en stutte te versterk .

source: remember this when you are investigating and designing your skeleton .
af: hou dit in gedagte wanneer jy jou skelet ondersoek en ontwerp .

source: need ideas on how to build a skeleton from rolled up newspaper? http www.youtube.com watch?v ezminbospla
af: het jy idees nodig hoe om 'n skelet met opgerolde koerantpapier te bou? goo.gl 5bhai

source: now you need to use the information we found out to come up with a design for your skeleton .
af: jy het nou die inligting nodig wat ons reeds bekom het om 'n ontwerp van 'n skelet te maak .

source: your skeleton should have the following specifications
af: die skelet moet aan die volgende vereistes voldoen

source: your design has the following constraints
af: jou ontwerp is onderhewig aan die volgende beperkings

source: once you have thought about these specifications you need to answer these questions
af: sodra jy oor hierdie spesifikasies nagedink het moet jy die volgende vrae beantwoord

source: what do you need to design ?
af: wat is dit wat jy moet ontwerp ?

source: what will the size and shape of your skeleton be ?
af: wat sal die grootte en vorm van jou skelet wees ?

source: remember that your skeleton must stand up straight for at least 3 minutes .
af: onthou dat die skelet vir ten minste drie minute moet kan regopstaan .

source: what materials are you going to use to build your skeleton .
af: watter materiale gaan jy gebruik om die skelet mee te bou ?

source: make a list of all the materials you will need .
af: maak 'n lys van al die nodige materiale .

source: what tools are you going to need to make your skeleton ?
af: watter gereedskap gaan jy nodig h vir die maak van die skelet ?

source: are there any other specifications and constraints that you can think of for your skeleton ?
af: is daar enige ander spesifikasies en beperkings met betrekking tot die skelet waaraan jy kan dink ?

source: when making your skeleton you may come up with a better design !
af: jy mag dalk met 'n beter ontwerp vorendag kom terwyl jy met die eerste skelet besig is !

source: so leave some space for a second drawing at the bottom .
af: laat daarom onderaan plek oop vir 'n tweede tekening .

source: now you need to draw some designs for your skeleton .
af: nou moet jy 'n paar ontwerpe vir jou skelet teken .

source: use scrap pieces of paper to do your first designs .
af: gebruik rofwerkpapier om die eerste ontwerpe te doen .

source: once you are happy with your design use the space below to draw your final design .
af: sodra jy tevrede is met die ontwerp gebruik die ruimte hieronder om die finale ontwerp in te teken .

source: label your drawing showing what materials you are going to use for the different parts .
af: voorsien die tekening van byskrifte wat aandui watter materiale jy vir die verskillende dele gaan gebruik .

source: now comes the fun part !
af: ons kom nou by die lekker deel !

source: you have to make your skeleton according to your sketch and using the materials you identified .
af: jy moet nou die skelet volgens jou tekening maak met die materiale wat jy gedentifiseer het .

source: do this in class .
af: doendit in die klas .

source: once you have all finished making your skeletons you need to show your classmates what you made and tell you what you did to make your skeleton .
af: sodra almal hul skelette klaar gemaak het moet julle elkeen vir jul klasmaats wys wat julle gemaak het en aan hulle verduidelik hoe dit gemaak is .

source: this is called presenting your design .
af: dit word die aanbieding van die ontwerp genoem .

source: answer the following questions about your skeleton .
af: beantwoord die volgende vrae oor die skelet

source: did your skeleton stand up for 3 minutes without your support ?
af: kon die skelet vir drie minute sonder enige hulp regop staan ?

source: what could you change in your skeleton to make it work better ?
af: wat sou jy aan die skelet verander om dit beter te laat werk ?

source: did your skeleton fulfill all the requirements in the specifications given to you ?
af: het die skelet voldoen aan al die vereistes in die spesifikasies wat aan jou gegee is ?

source: if you ever had to build this skeleton again what would you do differently ?
af: indien jy ooit weer so 'n skelet moes bou wat sal jy anders doen ?

source: an important part of the design process is to communicate what you found to others so they can learn from what you did .
af: 'n belangrike deel van die ontwerp proses is om jou bevindings aan ander te kommunikeer sodat hulle uit jou ervaring kan leer .

source: write a paragraph below about the skeleton that you built what worked and what did not work .
af: skryf 'n paragraaf hieronder waarin jy vir jou onderwyser vertel van die skelet wat jy gebou het asook wat gewerk het en wat nie gewerk het nie .

source: jungle gym
af: klimraam

source: frame
af: raam

source: eggshell
af: eierdop

source: shell
af: dop

source: dog skeleton
af: hondeskelet

source: a cellphone tower
af: 'n selfoontoring

source: a crab skeleton
af: 'n krapskelet

source: scaffolding
af: steierwerk

source: a car
af: 'n motorkar

source: a basket holding fruit
af: 'n mandjie met vrugte

source: how would you strengthen a square shape ?
af: hoe sou jy 'n vierkantige vorm versterk ?

source: give two different ways .
af: noem twee verskillende maniere .

source: place a diagonal strut across from one corner to the next .
af: plaas 'n diagonale stut skuins vanaf een hoek na die ander of gebruik 'n hoeksteun op elke hoek .

source: give two examples of animals with skeletons that are frame structures .
af: gee twee voorbeelde van diere met skelette watraamstrukture is .

source: what is the name given to this type of skeleton ?
af: wat noem ons hierdie tipe skelet ?

source: endoskeletons dog human birds fish etc
af: endoskelet hond mens vols visse ens .

source: give two examples of animals with skeletons that are shell structures .
af: gee twee voorbeelde van diere met skelette wat dopstrukture is .

source: exoskeletons crab insect etc
af: eksoskelette krappe insekte ens .

source: what are the advantages to humans for having a frame structure as a skeleton ?
af: wat is die voordeel vir mense dat hulle 'n raamstruktuur in die vorm van 'n skelet het ?

source: frames provide support for the muscles for movement .
af: rame verskaf ondersteuning aan die spiere vir beweging .

source: the frame provides protection to the internal organs .
af: die raam beskerm ook die inwendige organe .

source: the frame structure does these while allowing the human to still grow as the bones are on the inside endoskeleton .
af: die raamstruktuur doen bogenoemde terwyl dit die mens steeds toelaat om te groei aangesien die bene aan die binnekant van die liggaam endoskelet is .

source: this means humans do not need to get a new skeleton when they grow as animals with exoskeletons do .
af: dit beteken dat mense nie nodig het om 'n nuwe skelet te kry wanneer hulle groei nie soos wat diere met eksoskelette moet doen .

source: read the following story to the class .
af: lees die volgende storie vir die klas .

source: let's read the following story together .
af: kom ons lees die volgende storie saam .

source: some animals stood on the soft green grass around the waterhole one day admiring the fine job that the maker had done !
af: 'n paar diere het eendag op die sagte groen gras om die watergat rondgestaan besig om die goeie werk van die skepper te bewonder !

source: the tortoise slowly and carefully said of all creation i think i like the flamingos the best !
af: die skilpad het stadig en versigtig ges van die hele skepping hou ek die meeste van die flaminke !

source: their beautiful pink and white feathers their graceful necks and long legs they're just amazing !
af: hulle pragtige pienk en wit vere hulle grasieuse nekke en lang bene hulle is net ongelooflik !

source: they are so beautiful maybe they're the most important .
af: hule is so mooi miskien is hulle die belangrikste .

source: warthog just harrumphed and rolled in the squishy brown mud munching on some roots .
af: vlakvark het net gesnork en in die sagte bruin modder gerol terwyl hy aan 'n paar wortels kou .

source: those flamingos are far too delicate! said the springbok look at that strong fearsome buffalo no one ever messes with him !
af: daardie flaminke is veels te pieperig! s die honger springbok. kyk na daardie sterk vreeslose buffel niemand mors ooit met hom nie !

source: his horns are so sharp he can pierce a rock !
af: sy horings is s skerp dat hy 'n rots kan deurboor .

source: i think he is the most important in all creation !
af: ek dink hy is die belangrikste in die hele skepping !

source: warthog just harrumphed and sat on the cool green grass taking a huge tasty mouthful .
af: vlakvark het net gesnork en op die koel groen gras gesit terwyl hy 'n groot sappige hap gras neem .

source: the baboon jumped from his perch in a nearby tree hahaha ing and kwahkwahkwah ing as he went. you are all so wrong !
af: die bobbejaan het vanuit sy sitplek in 'n boom daar naby gespring terwyl hy hahahaha en kwahkwahkwah skree .

source: look at the eagle she soars over everyone and can see everything .
af: julle is almal s verkeerd !

source: she is always safe high in the cliffs and never has to come to this messy old waterhole .
af: kyk na die arend sy sweef oor almal en kan alles sien .

source: she doesn't need us she is the most important of everyone !
af: sy is altyd veilig hoog in die kranse en hoef nooit na hierdie morsige ou watergat te kom nie .

source: warthog just harrumphed and scratched his back against the rough hard bark of a baobab .
af: vlakvark het net gesnork en sy rug teen die growwe harde bas van 'n kremetartboom geskuur .

source: the dungbeetle clambered on top of his ball rested his head on his hand and said you have no idea the ants now they're an important bunch !
af: die miskruier het bo op sy misbal gaan staan sy kop op sy poot laat rus en ges julle het geen benul nie die miere hulle is 'n belangrike klomp !

source: without those little fellows the entire world would be covered in dead stuff !
af: sonder daardie klein outjies sou die hele wreld onder dooie goed toegegooi gewees het !

source: the smell would be un be lie va ble !
af: die reuk sou on ge loof lik gewees het !

source: they are the most important by far !
af: hulle is verreweg die belangrikste !

source: warthog harrumphed really loudly this time. without plants we'd all be gone! and with that he shoved a clump of reeds and munched at the little insects escaping .
af: vlakvark het weer gesnork maar hierdie keer was dit baie harder .

source: after reading the story ask learners why the warthog said without plants we'd all be gone ?
af: nadat u die storie gelees het vra vir die leerders waarom die vlakvark ges het sonder plante is ons almal daarmee heen! ?

source: discuss the different things we get from plants use this opportunity to assess their existing knowledge about plants and photosynthesis .
af: bespreekdie verskillende dinge wat ons van plante kan kry gebruik hierdie geleentheid om leeders se bestaande kennis van plante en fotosintese te assesseer .

source: do you think plants get hungry ?
af: het jy al ooit gewonder of plante honger word ?

source: plants make their own food video
af: plante maak hul eie voedsel video

source: plants do not eat in the same way humans do .
af: plante het nie nodig om voedsel te eet soos mense nie .

source: they make their own food inside their little factories .
af: hulle maak self hulle voedsel in hulle eie fabrieke .

source: they do this through a process called photosynthesis
af: plante maak voedsel deur 'n proses wat fotosintese genoem word

source: why do animals need the food that plants make ?
af: waarom benodig diere die voedsel wat plante maak ?

source: discuss this with a friend and report back to the class .
af: bespreek hierdie vraag met 'n maat en rapporteer terug aan die klas .

source: animals need the food that plants make to carry out the life processes .
af: diere benodig die voedsel wat plante maak om hulle lewensprosesse aan die gang te hou .

source: if they do not have the food or oxygen they will die .
af: indien hulle nie voedsel of suurstof het nie sal hulle doodgaan .

source: facilitate this discussion to reach a conclusion that without plants animals will not be able to live .
af: fasiliteer hierdie bespreking sodat die gevolgtrekking bereik word dat diere nie sonder plante kan oorleef nie .

source: now we know that the warthog was right without plants we would all be gone! we would not have food to eat and we would not have oxygen to breathe .
af: in hierdie opsig was die vlakvark heeltemal reg sonder plante is ons almal daarmee heen! ons sou nie voedsel gehad het om te eet nie en ook nie suurstof om in te asem nie .

source: what would you be prepared to pay for a day's worth of oxygen ?
af: hoeveel sou jy bereid wees om te betaal vir genoeg suurstof vir een dag ?

source: plants make this all for free for us !
af: plante maak genoeg suurstof vir ons almal heeltemal gratis !

source: at the beginning of this term you learnt that animals and plants are interdependent that means they depend on each other to survive .
af: aan die begin van hierdie kwartaal het jy geleer dat diere en plante interafhanklik is dit beteken dat hulle mekaar nodig het en afhanklik van mekaar is om te oorleef .

source: all living plants and animals need food to give them energy in order to survive .
af: alle lewende plante en diere het voedsel vir energie nodig om te kan oorleef .

source: plants make their own food through photosynthesis .
af: plante kan hulle eie voedsel deur middel van fotosintese vervaardig .

source: living things that can make their own food are called producers because they produce their own food .
af: lewende dinge wat hulle eie voedsel kan maak word produseerders genoem omdat hulle hul eie voedsel produseer .

source: turn to a friend .
af: draai na 'n maat .

source: take turns to explain what ingredients a plant uses during the process of photosynthesis and what the plants make or produce from this .
af: maak beurte om te verduidelik watter bestanddele 'n plant gedurende die proses van fotosintese gebruik en wat die plante hiervan maak of produseer .

source: write your answer below .
af: skryf die antwoord hieronder .

source: a plant uses sunlight energy water and carbon dioxide during photosynthesis and makes food sugars and oxygen .
af: 'n plant gebruik sonligenergie water en koolstofdioksied gedurende fotosintese en maak voedsel suikers en suurstof .

source: animals can't use sunlight water and carbon dioxide to make food like plants do .
af: diere kan nie soos 'n plant sonligenergie water en koolstofdioksied gebruik om voedsel te maak nie .

source: animals need to eat plants or other animals for energy to carry out their life processes .
af: diere moet plante of ander diere eet om energie te kry om hul lewensprosesse aan die gang te hou .

source: living things that get their energy by eating either a plant or an animals are called consumers .
af: lewende dinge wat hul energie verkry deur f 'n plant f 'n dier te eet word verbruikers genoem .

source: hand out little pieces of paper post it notes work well and get learners to write their favourite animal on it .
af: handig klein stukkies papier uit post its werk goed en laat die leerders die naam van hul geliefkoosde dier daarop neerskryf .

source: on the board make three columns and write as heading on each plant eaters or herbivores rightarrow meat eaters or carnivores rightarrow omnivores .
af: maak drie kolomme op die bord en skryf as kolomopskrifte die volgende planteters of herbivore rightarrow vleiseters of karnivore rightarrow alleseters of omnivore .

source: ask learners to think about their animal and what they would eat .
af: vra leerders om na te dink oor hul gunsteling dier en wat hy eet .

source: let learners paste their post its or little papers with prestik in the correct column .
af: laat leerders hul post its of klein papiertjies met prestik in die korrekte kolom plak .

source: discuss the adaptations similarities and differences between groups with the class .
af: bespreek die aanpassings ooreenkomste en verskille tussen die groepe met die klas .

source: preparation collect and display as many books and reading material related to animals as possible and where possible display information specific to the animals in the activity .
af: voorbereiding versamel en stal soveel as moontlik boeke en leesstof wat oor diere handel uit en waar moontlik vertoon inligting spesifiek oor die diere in die aktiwiteit .

source: 3 carnivores are
af: drie karnivore is

source: 3 herbivores are
af: drie herbivore is

source: 3 omnivores are
af: drie omnivore is

source: 3 scavengers are
af: drie aasdiere is

source: 3 decomposers are
af: drie ontbinders is

source: answers
af: antwoorde

source: crocodile
af: krokodil

source: animals that come to drink at the water
af: diere wat kom water drink

source: dolphin
af: dolfyn

source: fish
af: visse

source: mosquito
af: muskiet

source: warm blooded animals
af: bloed van endoterme diere

source: shark
af: haai

source: fish seals penguins etc .
af: visse robbe pikkewyne ens .

source: lion
af: leeu

source: leopard
af: luiperd

source: eagle
af: arend

source: rodents rabbits snakes fish etc .
af: knaagdiere hase slange visse ens .

source: seal
af: rob

source: fish crabs snails etc
af: visse krappe slakke ens .

source: elephant
af: olifant

source: leaves fruit off trees
af: blare vrugte van bome

source: horse
af: perd

source: buffalo
af: buffel

source: grasshopper
af: sprinkaan

source: squirrel some squirrels have been known to eat small insects birds etc when food is very scarce
af: eekhoring dit is bekend dat eekhorings soms klein insekte en vols sal eet wanneer voedsel skaars is

source: zebra
af: sebra

source: rhino
af: renoster

source: cow
af: koei

source: pig
af: vark

source: cockroach
af: kakkerlak

source: flamingo
af: flamink

source: filter feeders small plant and animal material
af: filtervoeders filtreer fyn plant en dieremateriaal

source: fox
af: jakkals

source: vulture
af: aasvol

source: crab
af: krap

source: earthworm
af: erdwurm

source: fly
af: vlieg

source: snail
af: slak

source: ask the question so if all animals depend on plants for food what about an animal that never eats plants like a crocodile or a lion or a shark perhaps ?
af: vra die vraag as al die diere afhanklik van plante vir voedsel is wat van 'n dier wat nooit plante eet nie soos 'n krokodil 'n leeu of miskien 'n haai ?

source: do they depend on plants for food ?
af: is hulle afhanklik van plante vir voedsel ?

source: discuss this at length without giving the answer away to judge their level of understanding of the preceding work .
af: bespreek hierdie onderwerp breedvoerig sonder om die antwoord weg te gee sodat u die leerders se begrip van die voorafgaande werk kan toets .

source: discuss predator and prey animals and let learners identify predator and prey relationships and justify their choices by listing adaptations in the predator that allows it to catch its prey .
af: bespreek roof en prooidiere en laat die leerders roof en prooiverwantskappe identifiseer en hulle keuses staaf deur aanpassings in die roofdier te lys wat dit in staat stel om sy prooi te vang .

source: where possible identify characteristics in prey animals that help them elude predators .
af: waar moontlik identifiseer eienskappe in prooidiere wat hulle help om roofdiere te ontwyk .

source: where do lions or sharks get their energy from ?
af: waar kry 'n leeu of haai hul energie vandaan ?

source: they do not eat plants .
af: hulle eet nie plante nie .

source: the learners should have a much better idea of how these predators will get their energy hence the questions here .
af: die leerders behoort reeds 'n baie beter idee te h waarvandaan hierdie roofdiere hul energie kry gevolglik hierdie vrae .

source: it would be a good point to let them reflect on their own developing knowledge and understanding at this point using this question answer in preparation for the following work on food chains .
af: dit sal gepas wees om hulle toe te laat om oor hulle eie groeiende kennis en insig na te dink deur gebruik te maak van hierdie vraag antwoord ter voorbereiding op die volgende werk oorvoedselkettings .

source: there is a feeding relationship between producers and consumers .
af: daar is 'n voedingsverwantskap tussen produseerders en verbruikers .

source: we call this relationship a food chain .
af: ons illustreer hierdie verwantskap met 'n voedselketting .

source: a food chain describes how each living thing gets food and how energy is passed from one organism to the next .
af: 'n voedselketting beskryf hoe elke organisme voedsel verkry en hoe energie van die een organisme na die volgende vloei .

source: a common misconception is that the sun is part of the food chain .
af: 'n algemene wanbegrip is dat die son deel van die voedselketting is .

source: this is incorrect .
af: dit is verkeerd .

source: the sun is the source of energy but it is not a source of food for the plant .
af: die son is wel die bron van energie maar is nie 'n bron van voedsel vir die plant nie .

source: the sun is not food for the plant .
af: die son is nie voedsel vir die plant nie .

source: so the food chain does not start with the sun it starts with the plant which is the producer of food .
af: daarom begin die voedselketting nie met die son nie dit begin met die plant wat die produseerder van voedsel is .

source: the learners should just know that the sun is the source of energy not food otherwise plants will not be able to make their own food .
af: die leerders moet verstaan dat die son die bron van energie is maar nie van voedsel nie anders sal plante nie daartoe in staat wees om hulle eie voedel te produseer nie .
